Revit 2026 API

# TableCellStyleFontName Property

---

The font used for this style

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string FontName { get; set; }
```
```vb
Public Property FontName As String
	Get
	Set
```
```cpp
public:
property String^ FontName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member FontName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

TableCellStyle Class

Autodesk.Revit.DB Namespace